Masmiseim36/nxpSDK/devices/MK22FA12/drivers/fsl_smartcard_uart.c
/*
 * The Clear BSD License
 * Copyright (c) 2015-2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2017 NXP
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted (subject to the limitations in the disclaimer below) provided
 * that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of the copyright holder nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE GRANTED BY THIS LICENSE.
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "fsl_smartcard_uart.h"

/*******************************************************************************
* Variables
******************************************************************************/
/* Array of UART peripheral base address. */
static UART_Type *const s_uartBases[] = UART_BASE_PTRS;
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
/* Array of UART clock name. */
static const clock_ip_name_t s_uartClock[] = UART_CLOCKS;
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

/*******************************************************************************
* Prototypes
******************************************************************************/
static void smartcard_uart_CompleteSendData(UART_Type *base, smartcard_context_t *context);
static void smartcard_uart_StartSendData(UART_Type *base, smartcard_context_t *context);
static void smartcard_uart_CompleteReceiveData(UART_Type *base, smartcard_context_t *context);
static void smartcard_uart_StartReceiveData(UART_Type *base, smartcard_context_t *context);
static void smartcard_uart_SetTransferType(UART_Type *base, smartcard_context_t *context, smartcard_control_t control);
static void smartcard_uart_TimerInit(uint8_t channel);
void smartcard_uart_TimerStart(uint8_t channel, uint32_t time);
static void smartcard_uart_TimerStop(uint8_t channel);
static uint32_t smartcard_uart_GetInstance(UART_Type *base);
/*******************************************************************************
* Code
******************************************************************************/

/*!
 * @brief Get the UART instance from peripheral base address.
 *
 * @param base UART peripheral base address.
 * @return UART instance.
 */
static uint32_t smartcard_uart_GetInstance(UART_Type *base)
{
    uint32_t instance;
    uint32_t uartArrayCount = (sizeof(s_uartBases) / sizeof(s_uartBases[0]));
    /* Find the instance index from base address mappings. */
    for (instance = 0; instance < uartArrayCount; instance++)
    {
        if (s_uartBases[instance] == base)
        {
            break;
        }
    }

    assert(instance < uartArrayCount);

    return instance;
}

/*!
 * @brief Finish up a transmit by completing the process of sending data and disabling the interrupt.
 *
 * @param base The UART peripheral base address.
 * @param context A pointer to a SMARTCARD driver context structure.
 */
static void smartcard_uart_CompleteSendData(UART_Type *base, smartcard_context_t *context)
{
    assert((NULL != context));

    /* Disable TCIE and TI interrupt */
    base->C2 &= ~(UART_C2_TCIE_MASK | UART_C2_TIE_MASK);

    /* Switch to receive mode after transmission is complete */
    base->C3 &= ~UART_C3_TXDIR_MASK;
    /* disable transmitter after transmit */
    base->C2 &= ~UART_C2_TE_MASK;
    /* Update the information of the module driver context */
    context->xIsBusy = false;
    context->transferState = kSMARTCARD_IdleState;
    /* Clear txSize to avoid any spurious transmit from ISR */
    context->xSize = 0u;
    /* Invoke user call-back */
    if (NULL != context->transferCallback)
    {
        context->transferCallback(context, context->transferCallbackParam);
    }
}

/*!
 * @brief Finish up a receive by completing the process of receiving data and disabling the interrupt.
 *
 * @param base The UART peripheral base address.
 * @param context A pointer to a SMARTCARD driver context structure.
 */
static void smartcard_uart_CompleteReceiveData(UART_Type *base, smartcard_context_t *context)
{
    assert(NULL != context);

    /* Disable receive data full interrupt */
    base->C2 &= ~UART_C2_RIE_MASK;

    /* Read data from fifo */
    while ((base->RCFIFO) && (context->xSize))
    {
        /* Get data and put into receive buffer */
        *context->xBuff = (uint8_t)(base->D);
        ++context->xBuff;
        --context->xSize;
    }

    if (context->tType == kSMARTCARD_T1Transport)
    {
        base->C2 &= ~UART_C2_RE_MASK;
    }
    /* Update the information of the module driver context */
    context->xIsBusy = false;
    context->transferState = kSMARTCARD_IdleState;
    /* Invoke user call-back */
    if (NULL != context->transferCallback)
    {
        context->transferCallback(context, context->transferCallbackParam);
    }
}

/*!
 * @brief Initiate (start) a transmit by beginning the process of sending data and enabling the interrupt.
 *
 * @param base The UART peripheral base address.
 * @param context A pointer to a SMARTCARD driver context structure.
 */
static void smartcard_uart_StartSendData(UART_Type *base, smartcard_context_t *context)
{
    assert(NULL != context);

    context->transferState = kSMARTCARD_TransmittingState;
    /* Disable transmitter */
    base->C2 &= ~(UART_C2_TE_MASK);
    /* Check if current transport protocol is T=1 */
    if (context->tType == kSMARTCARD_T1Transport)
    { /* Reset CWT timer at the beginning of transmission only */
        context->timersState.cwtExpired = false;
        /* clear any pending Character WT interrupt flag */
        base->IS7816 |= UART_IS7816_CWT_MASK;
        /* The TLEN does not count the NAD, PCB, LEN, LRC */
        base->TL7816 = context->xSize - 4u;
    }
    context->xIsBusy = true;
    /* Set the TX pin as output */
    base->C3 |= UART_C3_TXDIR_MASK;
    /* Flush tx fifo */
    base->CFIFO |= 0x80;
    /* Enable transmitter */
    base->C2 |= (UART_C2_TE_MASK);

